my_99_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    #fail
    cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cat = Cat.find(params[:id])
    if Cat.find(params[:id])